# BuildingEnvelopeAnalyzerOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingEnvelopeAnalyzerOptions Members
BuildingEnvelopeAnalyzerOptions Class Constructors Methods Properties See Also
---
The BuildingEnvelopeAnalyzerOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BuildingEnvelopeAnalyzerOptions | Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the BuildingEnvelopeAnalyzerOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalyzeEnclosedSpaceVolumes | Whether or not to analyze interior connected regions inside the building forming enclosed space volumes. |
| GridCellSize | The cell size for the uniform cubical grid used when analyzing the building envelope. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OptimizeGridCellSize | Whether or not to use the exact value for the cell size or let the analyzer optimize the cell size based on the specified grid size |

# See Also
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace